---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.LapSplicePosition
source: html/3bcff20d-5715-10c6-a3b6-affee02e1263.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.LapSplicePosition Property

The fabric lap splice position in the fabric distribution.

## Syntax (C#)
```csharp
public FabricLapSplicePosition LapSplicePosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration